{
  "key_1": "Govern Beyond Boundaries",
  "key_2": "Unify, Simplify, Privatize: Synterix Makes SaaS Operations Smarter.",
  "key_3": "Get Started",
  "key_4": "Unified Privatized Operations",
  "key_5": "Solves the challenge of fragmented O&M after SaaS privatization, with a central cluster efficiently managing multiple edge clusters to reduce costs and boost efficiency.",
  "key_6": "Zero-Invasion Seamless Deployment",
  "key_7": "Enables non-intrusive integration via Helm Charts and namespace management for quick deployment and ensured security compliance",
  "key_8": "Intelligent Resource and Version Management",
  "key_9": "Offers flexible resource allocation, one-click deployment, and CI/CD integration, supporting smooth upgrades and canary releases for stable services",
  "key_10": "Powerful DevOps Tools",
  "key_11": "Provides intuitive desktop and CLI clients for a robust control plane and remote access, empowering modern DevOps operations.",

  "key_12": "Service Support",
  "key_13": "Empowering development, sharing achievements",
  "key_14": "Professional Service Support",
  "key_15": "We provide professional services for enterprises and individuals who need extra help, enabling your projects to run more efficiently.",
  "key_16": "Custom Development: Tailor features or optimizations based on your specific needs",
  "key_17": "Professional Integration: Seamlessly integrate this software with your existing systems",
  "key_18": "Performance Optimization: Enhance performance tailored to your usage scenarios",
  "key_19": "Sponsorship Program",
  "key_20": "Become a project sponsor. Your sponsorship will directly support ✓ continuous core feature development ✓ documentation and tutorial improvements ✓ community support and maintenance",
  "key_21": "Buy Developers a Coffee",
  "key_22": "Even small contributions make a big difference! Every bit of your support motivates us to continue open-source efforts.",
  "key_23": "WeChat Donation",
  "key_24": "Alipay Donation",
  "key_25": "Join the Community, Walk with Developers",
  "key_26": "Discussion Groups & Official Community",
  "key_27": "WeChat Group"
}