{"type":"data","nodes":[{"type":"data","data":[{"lang":1,"langInfo":2,"langs":4,"tree":11,"page":72},"en-us",{"name":3,"value":1},"English",[5,7],{"name":3,"value":1,"url":6},"/en-us/support",{"name":8,"value":9,"url":10},"中文","zh-cn","/zh-cn/support",[12,18,31,52,67],{"title":13,"url":14,"index":15,"lang":1,"level":16,"children":17},"Intro","/intro",2,1,[],{"title":19,"url":20,"index":21,"lang":1,"level":16,"children":22},"Install","/install",3,[23,27],{"title":24,"url":25,"index":16,"lang":1,"level":15,"children":26},"Install synterix-central","/install/chart",[],{"title":28,"url":29,"index":21,"lang":1,"level":15,"children":30},"Install synterix-edge","/install/edge-chart",[],{"title":32,"url":33,"index":34,"lang":1,"level":16,"children":35},"Components","/component",4,[36,40,44,48],{"title":37,"url":38,"index":16,"lang":1,"level":15,"children":39},"synterix-central-gateway","/component/synterix-central-gateway",[],{"title":41,"url":42,"index":15,"lang":1,"level":15,"children":43},"synterix-central-admin","/component/synterix-central-admin",[],{"title":45,"url":46,"index":21,"lang":1,"level":15,"children":47},"synterix-edge-gateway","/component/synterix-edge-gateway",[],{"title":49,"url":50,"index":34,"lang":1,"level":15,"children":51},"synterix-kube-proxy","/component/synterix-kube-proxy",[],{"title":53,"url":54,"index":55,"lang":1,"level":16,"children":56},"Toolkit","/toolkit",5,[57,62],{"title":58,"url":59,"index":60,"lang":1,"level":15,"children":61},"Synterix CLI","/toolkit/cli",18,[],{"title":63,"url":64,"index":65,"lang":1,"level":15,"children":66},"Synterix Desktop App","/toolkit/ui",20,[],{"title":68,"url":69,"index":70,"lang":1,"level":16,"children":71},"Support","/support",6,[],{"title":68,"url":69,"index":70,"lang":1,"level":16,"children":73,"html":74,"prev":75,"next":78},[],"",{"title":13,"url":14,"index":15,"lang":1,"level":16,"children":76,"html":77},[],"\u003Cp>Synterix is a cutting-edge software solution designed to address the challenges of unified operations and maintenance (O&amp;M) for SaaS services following privatization deployment. It operates on Kubernetes (k8s) and is divided into a central cluster and edge clusters, offering a seamless, zero-invasion approach to managing distributed SaaS deployments.\u003C/p>\n\u003Ch2>Problem Statement\u003C/h2>\n\u003Cp>In the SaaS market, customers often demand privatization deployment due to data security, compliance, and customization requirements. However, this leads to several significant challenges:\u003C/p>\n\u003Cul>\n\u003Cli>\u003Cstrong>Fragmented O&amp;M\u003C/strong>: After privatization, maintenance tasks are scattered across multiple clusters, significantly increasing operational costs and complexity.\u003C/li>\n\u003Cli>\u003Cstrong>Code Divergence\u003C/strong>: Customized deployments often cause code to diverge from the main branch, making maintenance and updates difficult.\u003C/li>\n\u003Cli>\u003Cstrong>Inconsistent Service Levels\u003C/strong>: Different clusters may experience varying levels of performance, security, and reliability, complicating service quality assurance.\u003C/li>\n\u003Cli>\u003Cstrong>Lack of Centralized Control\u003C/strong>: Without a unified management system, monitoring, updates, and troubleshooting become inefficient and error-prone.\u003C/li>\n\u003Cli>\u003Cstrong>Resource Management\u003C/strong>: Manually allocating and scaling resources across disparate clusters is time-consuming and prone to errors.\u003C/li>\n\u003C/ul>\n\u003Cp>Synterix aims to solve these issues by providing a centralized, efficient, and automated solution for managing privatized SaaS deployments.\u003C/p>\n\u003Ch2>Architecture\u003C/h2>\n\u003Cp>\u003Cimg src=\"/images/synterix-framework.png\" alt=\"synterix-framework\">\u003C/p>\n\u003Cp>Synterix operates with a central cluster and multiple edge clusters:\u003C/p>\n\u003Cul>\n\u003Cli>\u003Cstrong>Central Cluster\u003C/strong>: Hosts the core Synterix service, which oversees and manages all edge clusters. It serves as the control plane, ensuring unified O&amp;M, monitoring, and resource management.\u003C/li>\n\u003Cli>\u003Cstrong>Edge Clusters\u003C/strong>: Deployed at customer sites (privatized environments), these clusters run edge services managed by the central cluster. Each edge cluster typically requires access to only one or more specific namespaces within the Kubernetes environment.\u003C/li>\n\u003C/ul>\n\u003Ch3>Key Features\u003C/h3>\n\u003Cul>\n\u003Cli>\u003Cstrong>Zero Invasion\u003C/strong>: Synterix integrates seamlessly without requiring modifications to existing code or infrastructure.\u003C/li>\n\u003Cli>\u003Cstrong>Helm Chart Deployment\u003C/strong>: Simplifies installation and configuration using Helm charts, ensuring consistency across deployments.\u003C/li>\n\u003Cli>\u003Cstrong>Namespace-Based Management\u003C/strong>: Edge services operate within designated namespaces, minimizing security risks and simplifying permissions management.\u003C/li>\n\u003Cli>\u003Cstrong>Service State Reporting\u003C/strong>: Services running in edge cluster namespaces can report their status to the central cluster, enabling proactive service alerts, performance monitoring, and incident response.\u003C/li>\n\u003Cli>\u003Cstrong>Additional Capabilities\u003C/strong>:\u003Cul>\n\u003Cli>\u003Cstrong>Automated Scaling\u003C/strong>: Dynamically adjusts resources based on workload and customer needs.\u003C/li>\n\u003Cli>\u003Cstrong>Security Compliance\u003C/strong>: Ensures data isolation and compliance with local regulations through namespace segregation and encryption.\u003C/li>\n\u003Cli>\u003Cstrong>Backup and Recovery\u003C/strong>: Centralized backup management for edge clusters to ensure data integrity and disaster recovery.\u003C/li>\n\u003C/ul>\n\u003C/li>\n\u003C/ul>\n\u003Ch2>Remote Resource Management\u003C/h2>\n\u003Cp>Synterix provides advanced remote resource management features:\u003C/p>\n\u003Cul>\n\u003Cli>\u003Cstrong>Flexible Resource Allocation\u003C/strong>: Based on customer subscription plans, Synterix can release specific Kubernetes resources (e.g., CPU, memory, storage) in edge clusters, ensuring optimal performance and cost-efficiency.\u003C/li>\n\u003Cli>\u003Cstrong>One-Click Deployment\u003C/strong>: Supports one-click deployment of services tailored to different customer tiers, streamlining onboarding and scaling.\u003C/li>\n\u003C/ul>\n\u003Ch2>CI/CD Integration for Seamless Updates\u003C/h2>\n\u003Cp>The central cluster integrates with CI/CD pipelines to manage version updates across edge clusters:\u003C/p>\n\u003Cul>\n\u003Cli>\u003Cstrong>Smooth Upgrades\u003C/strong>: Ensures minimal downtime and disruption during updates.\u003C/li>\n\u003Cli>\u003Cstrong>Canary Releases and Gray Releases\u003C/strong>: Enables staged rollouts, allowing for testing and validation in production environments before full deployment.\u003C/li>\n\u003Cli>\u003Cstrong>Version Consistency\u003C/strong>: Maintains code consistency across all clusters, reducing maintenance overhead and enhancing reliability.\u003C/li>\n\u003C/ul>\n\u003Ch2>Deployment Process\u003C/h2>\n\u003Col>\n\u003Cli>\u003Cstrong>Edge Cluster Accessibility\u003C/strong>: The customer-side edge cluster must allow access to the central cluster’s domain.\u003C/li>\n\u003Cli>\u003Cstrong>Credential Assignment\u003C/strong>: The central cluster assigns a unique \u003Ccode>appId\u003C/code> and \u003Ccode>secret\u003C/code> to the edge cluster for authentication and authorization.\u003C/li>\n\u003Cli>\u003Cstrong>Synterix Installation\u003C/strong>: The edge cluster installs Synterix using the provided Helm chart, configuring it with the central cluster domain, \u003Ccode>appId\u003C/code>, and \u003Ccode>secret\u003C/code>.\u003C/li>\n\u003Cli>\u003Cstrong>Service Deployment\u003C/strong>: The central cluster deploys the SaaS service YAML files to the edge cluster based on the assigned \u003Ccode>appId\u003C/code>, completing the initial setup.\u003C/li>\n\u003Cli>\u003Cstrong>Status Reporting and Monitoring\u003C/strong>: The edge cluster reports service status to the central cluster, enabling unified monitoring, alerts, and O&amp;M.\u003C/li>\n\u003Cli>\u003Cstrong>Continuous Updates\u003C/strong>: Leveraging CI/CD, the central cluster manages version updates, ensuring smooth upgrades and gray releases in edge clusters.\u003C/li>\n\u003C/ol>\n\u003Ch2>DevOps and O&amp;M Tools\u003C/h2>\n\u003Cp>Synterix provides robust tools to facilitate DevOps practices:\u003C/p>\n\u003Cul>\n\u003Cli>\u003Cstrong>Desktop Client\u003C/strong>: Offers a Rancher-like control plane for intuitive management of central and edge clusters. Key features include:\u003Cul>\n\u003Cli>\u003Cstrong>Local TCP Proxy\u003C/strong>: Creates secure tunnels to edge cluster services, allowing direct access via Shell, database clients, or other software tools.\u003C/li>\n\u003Cli>\u003Cstrong>Resource Visualization\u003C/strong>: Real-time monitoring of cluster health, resource usage, and service status.\u003C/li>\n\u003C/ul>\n\u003C/li>\n\u003Cli>\u003Cstrong>CLI Client\u003C/strong>: Provides command-line access for managing local service proxies and executing advanced operations, enhancing automation and scripting capabilities.\u003C/li>\n\u003C/ul>\n\u003Ch2>Benefits\u003C/h2>\n\u003Cul>\n\u003Cli>\u003Cstrong>Reduced Operational Costs\u003C/strong>: Centralized management eliminates fragmented O&amp;M, lowering costs and improving efficiency.\u003C/li>\n\u003Cli>\u003Cstrong>Enhanced Security\u003C/strong>: Namespace isolation and zero-invasion architecture minimize security risks.\u003C/li>\n\u003Cli>\u003Cstrong>Improved Scalability\u003C/strong>: Flexible resource allocation and automated updates ensure scalability without compromising performance.\u003C/li>\n\u003Cli>\u003Cstrong>Simplified Compliance\u003C/strong>: Supports localized data handling and compliance with regional regulations.\u003C/li>\n\u003C/ul>\n\u003Ch2>Conclusion\u003C/h2>\n\u003Cp>Synterix revolutionizes the management of privatized SaaS deployments by providing a unified, secure, and efficient solution. With its zero-invasion approach, advanced remote management capabilities, and seamless integration with CI/CD pipelines, Synterix empowers businesses to maintain high service quality, reduce costs, and streamline operations across distributed environments.\u003C/p>\n\u003Cp>For more information, contact our support team or visit our documentation portal.\u003C/p>\n",{"title":32,"url":33,"index":34,"lang":1,"level":16,"children":79,"html":80},[],"\u003Ch2>Synterix Component List\u003C/h2>\n\u003Ctable>\n\u003Cthead>\n\u003Ctr>\n\u003Cth>Component\u003C/th>\n\u003Cth>Introduction\u003C/th>\n\u003C/tr>\n\u003C/thead>\n\u003Ctbody>\u003Ctr>\n\u003Ctd>\u003Ca href=\"/en-us/component/synterix-central-admin\">synterix-central-admin\u003C/a>\u003C/td>\n\u003Ctd>Core management service component of the data management platform\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>\u003Ca href=\"/en-us/component/synterix-central-gateway\">synterix-central-gateway\u003C/a>\u003C/td>\n\u003Ctd>Core communication hub in the distributed architecture system\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>\u003Ca href=\"/en-us/component/synterix-edge-gateway\">synterix-edge-gateway\u003C/a>\u003C/td>\n\u003Ctd>Core network component of the edge computing platform\u003C/td>\n\u003C/tr>\n\u003Ctr>\n\u003Ctd>\u003Ca href=\"/en-us/component/synterix-kube-proxy\">synterix-kube-proxy\u003C/a>\u003C/td>\n\u003Ctd>Core Kubernetes API gateway component of the platform\u003C/td>\n\u003C/tr>\n\u003C/tbody>\u003C/table>\n"],"uses":{"url":1}},{"type":"data","data":[{"keys":1},{"key_1":2,"key_2":3,"key_3":4,"key_4":5,"key_5":6,"key_6":7,"key_7":8,"key_8":9,"key_9":10,"key_10":11,"key_11":12,"key_12":13,"key_13":14,"key_14":15,"key_15":16,"key_16":17,"key_17":18,"key_18":19,"key_19":20,"key_20":21,"key_21":22,"key_22":23,"key_23":24,"key_24":25,"key_25":26,"key_26":27,"key_27":28},"Govern Beyond Boundaries","Unify, Simplify, Privatize: Synterix Makes SaaS Operations Smarter.","Get Started","Unified Privatized Operations","Solves the challenge of fragmented O&M after SaaS privatization, with a central cluster efficiently managing multiple edge clusters to reduce costs and boost efficiency.","Zero-Invasion Seamless Deployment","Enables non-intrusive integration via Helm Charts and namespace management for quick deployment and ensured security compliance","Intelligent Resource and Version Management","Offers flexible resource allocation, one-click deployment, and CI/CD integration, supporting smooth upgrades and canary releases for stable services","Powerful DevOps Tools","Provides intuitive desktop and CLI clients for a robust control plane and remote access, empowering modern DevOps operations.","Service Support","Empowering development, sharing achievements","Professional Service Support","We provide professional services for enterprises and individuals who need extra help, enabling your projects to run more efficiently.","Custom Development: Tailor features or optimizations based on your specific needs","Professional Integration: Seamlessly integrate this software with your existing systems","Performance Optimization: Enhance performance tailored to your usage scenarios","Sponsorship Program","Become a project sponsor. Your sponsorship will directly support ✓ continuous core feature development ✓ documentation and tutorial improvements ✓ community support and maintenance","Buy Developers a Coffee","Even small contributions make a big difference! Every bit of your support motivates us to continue open-source efforts.","WeChat Donation","Alipay Donation","Join the Community, Walk with Developers","Discussion Groups & Official Community","WeChat Group"],"uses":{"url":1}}]}
